; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob78) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate12)
	(at pallet1 distributor0)
	(clear crate11)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 439)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 398)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 33)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 77)
	(at crate2 distributor1)
	(on crate2 crate0)
	(= (weight crate2) 61)
	(at crate3 depot0)
	(on crate3 pallet0)
	(= (weight crate3) 94)
	(at crate4 distributor0)
	(on crate4 crate1)
	(= (weight crate4) 56)
	(at crate5 distributor0)
	(on crate5 crate4)
	(= (weight crate5) 99)
	(at crate6 depot0)
	(on crate6 crate3)
	(= (weight crate6) 72)
	(at crate7 depot0)
	(on crate7 crate6)
	(= (weight crate7) 36)
	(at crate8 depot0)
	(on crate8 crate7)
	(= (weight crate8) 68)
	(at crate9 distributor1)
	(on crate9 crate2)
	(= (weight crate9) 9)
	(at crate10 distributor1)
	(on crate10 crate9)
	(= (weight crate10) 5)
	(at crate11 distributor0)
	(on crate11 crate5)
	(= (weight crate11) 24)
	(at crate12 depot0)
	(on crate12 crate8)
	(= (weight crate12) 94)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate11)
		(on crate2 pallet1)
		(on crate3 crate5)
		(on crate5 crate2)
		(on crate6 pallet0)
		(on crate7 crate0)
		(on crate8 crate7)
		(on crate9 crate8)
		(on crate10 crate3)
		(on crate11 pallet2)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist0 crate12 crate8 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist0) (on crate12 crate8)
   added: (lifting hoist0 crate12) (clear crate8)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 10
2. (load hoist0 crate12 truck1 depot0)
   deleted: (lifting hoist0 crate12)
   added: (in crate12 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 94
   goals met: 1 of 10
3. (lift hoist2 crate10 crate9 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate9)
   added: (lifting hoist2 crate10) (clear crate9)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 10
4. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 10
5. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 5
   goals met: 1 of 10
6. (lift hoist2 crate9 crate2 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 crate2)
   added: (lifting hoist2 crate9) (clear crate2)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 10
7. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   changed: (current_load truck0) from 5 to 14
   goals met: 1 of 10
8. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 13 to 23
   goals met: 1 of 10
9. (unload hoist0 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck0) from 14 to 5
   goals met: 1 of 10
10. (lift hoist1 crate11 crate5 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist1) (on crate11 crate5)
   added: (lifting hoist1 crate11) (clear crate5)
   changed: (fuel-cost) from 23 to 24
   goals met: 1 of 10
11. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 24 to 34
   goals met: 1 of 10
12. (load hoist1 crate11 truck0 distributor0)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck0) (available hoist1)
   changed: (current_load truck0) from 5 to 29
   goals met: 1 of 10
13. (lift hoist1 crate5 crate4 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate4)
   added: (lifting hoist1 crate5) (clear crate4)
   changed: (fuel-cost) from 34 to 35
   goals met: 1 of 10
14. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 29 to 128
   goals met: 1 of 10
15. (lift hoist1 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate1)
   added: (lifting hoist1 crate4) (clear crate1)
   changed: (fuel-cost) from 35 to 36
   goals met: 1 of 10
16. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 128 to 184
   goals met: 1 of 10
17. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 36 to 46
   goals met: 1 of 10
18. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 46 to 56
   goals met: 1 of 10
19. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 56 to 57
   goals met: 1 of 10
20. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 184 to 261
   goals met: 1 of 10
21. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 57 to 67
   goals met: 1 of 10
22. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   changed: (fuel-cost) from 67 to 68
   goals met: 1 of 10
23. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 68 to 78
   goals met: 1 of 10
24. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 261 to 322
   goals met: 1 of 10
25. (unload hoist2 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck0) from 322 to 298
   goals met: 1 of 10
26. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 78 to 88
   goals met: 1 of 10
27. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 298 to 237
   goals met: 1 of 10
28. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 pallet1)
   goals met: 2 of 10
29. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 88 to 98
   goals met: 2 of 10
30. (load hoist2 crate11 truck0 distributor1)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck0) (available hoist2)
   changed: (current_load truck0) from 237 to 261
   goals met: 2 of 10
31. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 98 to 99
   goals met: 2 of 10
32. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 261 to 294
   goals met: 2 of 10
33. (unload hoist2 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck0) from 294 to 270
   goals met: 2 of 10
34. (drop hoist2 crate11 pallet2 distributor1)
   deleted: (lifting hoist2 crate11) (clear pallet2)
   added: (available hoist2) (at crate11 distributor1) (clear crate11) (on crate11 pallet2)
   goals met: 3 of 10
35. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 99 to 109
   goals met: 3 of 10
36. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 109 to 119
   goals met: 3 of 10
37. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 270 to 237
   goals met: 3 of 10
38. (drop hoist2 crate0 crate11 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate11)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate11)
   goals met: 4 of 10
39. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 237 to 181
   goals met: 4 of 10
40. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 119 to 129
   goals met: 4 of 10
41. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   changed: (current_load truck1) from 94 to 103
   goals met: 4 of 10
42. (lift hoist0 crate8 crate7 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate7)
   added: (lifting hoist0 crate8) (clear crate7)
   changed: (fuel-cost) from 129 to 130
   goals met: 3 of 10
43. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   changed: (current_load truck1) from 103 to 171
   goals met: 3 of 10
44. (lift hoist0 crate7 crate6 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate6)
   added: (lifting hoist0 crate7) (clear crate6)
   changed: (fuel-cost) from 130 to 131
   goals met: 3 of 10
45. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 171 to 207
   goals met: 3 of 10
46. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 131 to 141
   goals met: 3 of 10
47. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 207 to 263
   goals met: 3 of 10
48. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 263 to 227
   goals met: 3 of 10
49. (drop hoist2 crate7 crate0 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate0)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate0)
   goals met: 4 of 10
50. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck1) from 227 to 159
   goals met: 4 of 10
51. (drop hoist2 crate8 crate7 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate7)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate7)
   goals met: 5 of 10
52. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 159 to 150
   goals met: 5 of 10
53. (drop hoist2 crate9 crate8 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate8)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate8)
   goals met: 6 of 10
54. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 141 to 151
   goals met: 6 of 10
55. (lift hoist0 crate6 crate3 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate3)
   added: (lifting hoist0 crate6) (clear crate3)
   changed: (fuel-cost) from 151 to 152
   goals met: 6 of 10
56. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   changed: (current_load truck0) from 181 to 253
   goals met: 6 of 10
57. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 152 to 162
   goals met: 6 of 10
58. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 253 to 154
   goals met: 6 of 10
59. (drop hoist1 crate5 crate2 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate2)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate2)
   goals met: 7 of 10
60. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   changed: (fuel-cost) from 162 to 163
   goals met: 7 of 10
61. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 163 to 173
   goals met: 7 of 10
62. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 154 to 248
   goals met: 7 of 10
63. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 173 to 183
   goals met: 7 of 10
64. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 248 to 154
   goals met: 7 of 10
65. (drop hoist1 crate3 crate5 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate5)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 crate5)
   goals met: 8 of 10
66. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 154 to 149
   goals met: 8 of 10
67. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 183 to 193
   goals met: 8 of 10
68. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 149 to 77
   goals met: 8 of 10
69. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 9 of 10
70. (drop hoist1 crate10 crate3 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate3)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate3)
   goals met: 10 of 10
